{
  "backend/main.mo": "Main Motoko actor implementing client management, VM status tracking, notifications, chat messages, admin accounts, global announcements, and network monitoring with CRUD operations and authentication methods.",
  "backend/migration.mo": "Migration module that transforms old client records without vmStatus field to new records with vmStatus defaulting to #online, and adds chatMessages and adminAccounts maps.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including VM status indicators, client edit modal, chat widgets, admin chat interface, admin member management, and backend authentication with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication hooks, protected routes, admin/client dashboards, chat interfaces, forms, and UI components with their specific functionalities.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme colors using OKLCH color space, including Carbon Black and Neon Green accent colors for the dashboard theme.",
  "frontend/index.html": "HTML entry point for the LuidCorporation Dashboard Ecosystem application that loads the React app via main.tsx module script.",
  "frontend/src/App.tsx": "Root React application component configuring TanStack Router with admin and client routes, theme provider, authentication providers, protected routes, and global layout with footer and toast notifications.",
  "frontend/src/components/AdminChatInterface.tsx": "Admin chat interface component displaying client list sidebar and message thread view with real-time chat functionality, allowing admins to select clients and send/receive messages.",
  "frontend/src/components/AdminMemberManagement.tsx": "Form component for adding new admin accounts with username and password validation (minimum 6 characters). Uses mutation hook to create admins and displays success/error toasts.",
  "frontend/src/components/ClientChatWidget.tsx": "Floating chat widget button that opens a dialog for clients to send messages to support. Displays chat history with messages aligned by sender (client vs support).",
  "frontend/src/components/ClientEditModal.tsx": "Modal dialog for editing existing client records with form fields for all client properties (name, passwords, VPS details, plan, VM status). Validates required fields and updates via mutation hook.",
  "frontend/src/components/ClientList.tsx": "Table component displaying all registered clients with columns for ID, name, VPS info, plan, and VM status. Includes edit, delete, and send notification actions for each client row.",
  "frontend/src/components/ClientProfileMenu.tsx": "Dropdown menu component showing client avatar with initials, displaying client name and ID, with a logout option that redirects to home page.",
  "frontend/src/components/ClientProtectedRoute.tsx": "Route guard component that checks client authentication status and redirects unauthenticated users to the home page.",
  "frontend/src/components/ClientRegistrationForm.tsx": "Form component for registering new clients with fields for ID, name, client password, VPS credentials, plan, and VM status. Validates all required fields before submission.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright text 'LuidCorporation© 2026' with neon green border styling.",
  "frontend/src/components/GlobalAnnouncementBanner.tsx": "Banner component that displays a global announcement message at the top of the page with pulsing animation. Hidden when no announcement is set.",
  "frontend/src/components/GlobalAnnouncementInput.tsx": "Admin component for creating, updating, and clearing global announcements that display to all clients. Uses form with textarea, save button, and delete button with loading states.",
  "frontend/src/components/NetworkMonitoringToggle.tsx": "Admin component with radio buttons to toggle network monitoring status between 'normal' (2.5-4.8 Gbps) and 'offline' (0 Gbps) modes. Displays current status and updates via mutation.",
  "frontend/src/components/NetworkSpeedChart.tsx": "Client-facing card displaying real-time network speed chart using Recharts LineChart. Shows current speed in Gbps and historical data with simulated network monitoring.",
  "frontend/src/components/NotificationBell.tsx": "Bell icon popover component showing unread count badge, global announcements, and individual notifications. Includes clear all functionality and scrollable notification list.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to admin login page. Checks admin authentication status and renders children only if authenticated.",
  "frontend/src/components/SendNotificationModal.tsx": "Dialog modal for admins to send individual notifications to specific clients. Contains textarea for message input and handles submission with loading states.",
  "frontend/src/components/VpsCredentialsCard.tsx": "Card component displaying VPS credentials including IP address, username, password (with show/hide toggle), and plan name. Styled with neon-green theme.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances with Internet Identity authentication. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Context provider and hook for admin authentication state management. Handles login with remember-me option, logout, and persists auth state to localStorage or sessionStorage.",
  "frontend/src/hooks/useClientAuth.tsx": "Provides client authentication context with login/logout functions and persists client data to localStorage or sessionStorage based on 'remember me' preference.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication using DFINITY's AuthClient, providing login/logout functionality and identity management with delegation validation.",
  "frontend/src/hooks/useNetworkSpeedSimulation.ts": "Simulates network speed data (2.5-4.8 Gbps) using sine waves and random variation, updating every 2 seconds and respecting monitoring status (offline returns 0).",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on client records, global announcements, notifications, chat messages, network monitoring, and VM status management.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a Carbon Black and Neon Green color theme, including CSS custom properties for consistent styling across light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with ID/password authentication, remember me checkbox, and redirects to admin panel on successful login.",
  "frontend/src/pages/AdminPanel.tsx": "Main admin dashboard with tabs for managing clients, chat, administrators, and settings including client registration, announcements, and network monitoring.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard page component that displays VPS credentials, network speed chart, global announcements, and includes a chat widget. Uses client authentication hook to fetch and display client data including ID, name, and VPS details.",
  "frontend/src/pages/ClientLogin.tsx": "Client login page component that authenticates users via ID Luid and password against backend actor, with remember-me functionality. Redirects authenticated users to the client dashboard and displays error toasts for invalid credentials.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme (carbon-black, neon-green theme), extended utilities for borders/shadows, and animation keyframes. Uses OKLCH color space for theme variables and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking document for an admin panel application with VM status management, live chat support, and multi-admin authentication. Lists existing features (VM status indicators, chat interfaces, admin management) and pending feature requests."
}