{
  "backend/main.mo": "Main actor defining ClientRecord with VMStatus enum, managing client records, notifications, chat messages, global announcements, and network monitoring with CRUD operations and query functions.",
  "backend/migration.mo": "Migration module that transforms old client records without vmStatus to new records with vmStatus defaulting to #online, and initializes empty chatMessages map.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: VM status controls, VM status indicator, chat widget, admin chat panel, and admin profile display with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including authentication hooks, React Query hooks, UI components, pages, and configuration files with Carbon Black/Neon Green theming.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color system with Carbon Black and Neon Green color scheme.",
  "frontend/index.html": "HTML entry point with title 'LuidCorporation Dashboard Ecosystem' and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, theme provider, authentication providers, and routes for admin/client login and dashboards with protected route wrappers.",
  "frontend/src/components/AdminChatPanel.tsx": "Admin chat management interface displaying client list with unread counts, message history, and send message functionality with real-time updates.",
  "frontend/src/components/AdminProfileDisplay.tsx": "Component displaying admin username with avatar initials and Shield icon in a styled card using data from useAdminAuth hook.",
  "frontend/src/components/ChatWidget.tsx": "A floating chat widget component that allows clients to send and receive messages with admin support, displaying unread message counts and auto-scrolling to new messages.",
  "frontend/src/components/ClientEditModal.tsx": "A modal dialog component for editing existing client records, including fields for name, passwords, VPS credentials, plan, and VM status.",
  "frontend/src/components/ClientList.tsx": "Displays a table of all registered clients with actions to edit, delete, send notifications, and update VM status (online/offline/maintenance).",
  "frontend/src/components/ClientProfileMenu.tsx": "A dropdown menu component showing the authenticated client's profile information with avatar initials and a logout option.",
  "frontend/src/components/ClientProtectedRoute.tsx": "A route guard component that redirects unauthenticated clients to the home page and only renders children for authenticated users.",
  "frontend/src/components/ClientRegistrationForm.tsx": "A form component for registering new clients with fields for ID, name, client password, VPS IP, VPS credentials, and plan information.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying the copyright notice 'LuidCorporation© 2026'.",
  "frontend/src/components/GlobalAnnouncementBanner.tsx": "Displays a global announcement banner at the top of the page with an animated pulse effect when an announcement is active.",
  "frontend/src/components/GlobalAnnouncementInput.tsx": "An admin component for creating, updating, and clearing global announcements that are displayed to all clients.",
  "frontend/src/components/NetworkMonitoringToggle.tsx": "A card component with radio buttons to toggle network monitoring status between 'normal' (2.5-4.8 Gbps) and 'offline' (0 Gbps), using React Query hooks for fetching and updating status.",
  "frontend/src/components/NetworkSpeedChart.tsx": "Displays a real-time line chart of network speed using Recharts, showing current speed in Gbps and historical data from a simulation hook with region and latency metadata.",
  "frontend/src/components/NotificationBell.tsx": "A bell icon button with badge counter that opens a popover displaying global announcements and client-specific notifications, with functionality to clear all notifications.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated admin users to the login page using the admin auth hook and TanStack Router navigation.",
  "frontend/src/components/SendNotificationModal.tsx": "A dialog modal for admins to send individual notifications to specific clients, featuring a textarea for message input and mutation handling with toast feedback.",
  "frontend/src/components/VMStatusIndicator.tsx": "Displays VM status (online/offline/maintenance) in a card with color-coded indicators and descriptive text based on the VMStatus enum value.",
  "frontend/src/components/VpsCredentialsCard.tsx": "Shows VPS access credentials including IP address, username, password (with toggle visibility), and plan name in a formatted card layout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using Internet Identity, with React Query caching and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Provides admin authentication context with hardcoded credentials, supporting login/logout with optional remember-me functionality using localStorage or sessionStorage.",
  "frontend/src/hooks/useClientAuth.tsx": "Provides React context and hooks for client authentication, managing login/logout state and persisting client data to localStorage or sessionStorage based on 'remember me' preference.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication for ICP, providing a React context and hooks to manage identity state, login flow, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useNetworkSpeedSimulation.ts": "Simulates network speed data (2.5-4.8 Gbps) using sine waves and randomness, updating every 2 seconds and respecting monitoring status (returns 0 when offline).",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on client records, VM status, notifications, chat messages, global announcements, and network monitoring status using the ICP actor.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a carbon black and neon green color theme, including CSS custom properties for consistent dark mode styling across the application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component into the DOM.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with form for ID/password authentication, remember me checkbox, and navigation to admin panel on successful login using useAdminAuth hook.",
  "frontend/src/pages/AdminPanel.tsx": "Main admin dashboard with tabbed interface for managing clients, chat, announcements, and network monitoring, including logout functionality and admin profile display.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard page displaying VPS credentials, VM status indicator, network speed chart, notifications, and a chat widget. Uses client authentication and fetches client record data.",
  "frontend/src/pages/ClientLogin.tsx": "Client login page with ID Luid and password authentication, remember me functionality, and navigation to dashboard upon successful login. Validates credentials against backend actor.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (carbon-black, neon-green themes), container settings, border radius variables, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project state tracking document listing implemented features (VM status management, chat system, admin profile display) and pending feature requests for the Luid Corporation Dashboard admin panel."
}