{
  "backend/main.mo": "Main actor defining ClientRecord type with OS and plan expiry fields, managing client records, notifications, chat messages, global announcements, network monitoring, and chat system status with CRUD operations and query functions.",
  "backend/migration.mo": "Migration module that transforms OldClientRecord to NewClientRecord by adding operatingSystem (defaulting to #windows) and planExpiry (defaulting to 0) fields while preserving all other actor state.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: client registration form with OS/expiry fields, client edit modal updates, SSH instructions for Ubuntu, RDP instructions for Windows, and plan/expiry display in profile.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including components, hooks, pages, and their functionality related to admin/client authentication, CRUD operations, chat, and dashboard features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining dark theme color palette using Carbon Black backgrounds and design system tokens for components, borders, and charts.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'LuidCorporation Dashboard Ecosystem', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with admin/client login and dashboard routes, theme provider forcing dark mode, authentication providers, protected routes, layout with footer, and toast notifications.",
  "frontend/src/components/AdminChatPanel.tsx": "Admin chat management component displaying client list with unread counts, message thread view with typing indicators, and message sending interface using React Query hooks for real-time chat data.",
  "frontend/src/components/AdminProfileDisplay.tsx": "Displays the admin profile with an avatar showing initials, username, and a shield icon indicating administrator role.",
  "frontend/src/components/ChatSystemStatusIndicator.tsx": "Shows the current chat system status (online/offline) with a colored indicator and loading state.",
  "frontend/src/components/ChatSystemStatusToggle.tsx": "Provides a radio group control for admins to toggle the chat system between online and offline states.",
  "frontend/src/components/ChatWidget.tsx": "Floating chat widget for clients with message display, send functionality, unread count badge, and offline status handling.",
  "frontend/src/components/ClientEditModal.tsx": "Modal dialog for editing client records including name, passwords, VPS details, plan, VM status, operating system, and plan expiry date.",
  "frontend/src/components/ClientList.tsx": "Table displaying all client records with actions to edit, delete, send notifications, and update VM status inline.",
  "frontend/src/components/ClientProfileMenu.tsx": "Dropdown menu showing client profile info (name, ID, plan, expiry date) with logout functionality.",
  "frontend/src/components/ClientProtectedRoute.tsx": "Route guard component that redirects unauthenticated clients to the home page.",
  "frontend/src/components/ClientRegistrationForm.tsx": "Form component for registering new clients with fields for ID, name, password, VPS credentials, plan details, operating system selection, and plan expiry date. Handles form submission via mutation hook and displays success/error toasts.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright text 'LuidCorporation© 2026' with dark background and neon green border styling.",
  "frontend/src/components/GlobalAnnouncementBanner.tsx": "Banner component that displays a global announcement message at the top of the page with an alert icon and animated pulse effect. Only renders when announcement text exists.",
  "frontend/src/components/GlobalAnnouncementInput.tsx": "Admin form component for setting or clearing global announcements with a textarea input and save/delete buttons. Uses mutation hooks to update the announcement and syncs with current announcement data.",
  "frontend/src/components/NetworkMonitoringToggle.tsx": "Admin control component with radio buttons to toggle network monitoring status between 'normal' (2.5-4.8 Gbps) and 'offline' (0 Gbps) modes. Updates status via mutation hook.",
  "frontend/src/components/NetworkSpeedChart.tsx": "Card component displaying a real-time line chart of network speed using Recharts, showing current speed in Gbps and historical data with simulated network monitoring. Includes region and latency information.",
  "frontend/src/components/NotificationBell.tsx": "Popover notification bell component showing unread count badge, displaying global announcements and client-specific notifications in a scrollable list. Includes functionality to clear notifications.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks admin authentication status and redirects to login page if not authenticated. Renders children only when authenticated.",
  "frontend/src/components/RdpInstructionsCard.tsx": "Instructional card component displaying step-by-step guide for connecting to Windows server via RDP, including VPS credentials and a copy-to-clipboard button for the IP address.",
  "frontend/src/components/SendNotificationModal.tsx": "Modal dialog component for sending individual notifications to clients with a textarea input, form validation, and loading states using the useSendNotification hook.",
  "frontend/src/components/SshInstructionsCard.tsx": "Card component displaying SSH connection instructions for Ubuntu servers, including a copyable SSH command and step-by-step connection guide.",
  "frontend/src/components/VMStatusIndicator.tsx": "Card component that displays VM status (online/offline/maintenance) with color-coded indicators and descriptive messages.",
  "frontend/src/components/VpsCredentialsCard.tsx": "Card component displaying VPS credentials including IP address, username, password (with show/hide toggle), and plan information.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Context provider and hook for admin authentication with hardcoded credentials, supporting both localStorage and sessionStorage for remember-me functionality.",
  "frontend/src/hooks/useClientAuth.tsx": "Context provider and hook for client authentication that persists ClientRecord data to localStorage or sessionStorage based on remember-me preference.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using DFINITY's AuthClient, managing identity state, login/logout flows, and delegation validity.",
  "frontend/src/hooks/useNetworkSpeedSimulation.ts": "Hook that simulates realistic network speed data (2.5-4.8 Gbps) using sine waves and randomness, respecting monitoring status and maintaining a rolling 20-point history.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for client record CRUD operations, VM status updates, global announcements, notifications, chat messages, and chat system status management using the actor from useActor hook.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Carbon Black and Neon Green theme variables for both light and dark modes, defining colors for backgrounds, borders, accents, and UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with form for ID and password authentication, remember-me checkbox, and navigation to admin panel on successful login using useAdminAuth hook.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard with tabbed interface for managing clients (registration, announcements, network monitoring) and chat system, including logout functionality and profile display.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard displaying VPS credentials, VM status, network speed chart, SSH/RDP instructions based on OS, global announcements, notifications, and chat widget for authenticated clients.",
  "frontend/src/pages/ClientLogin.tsx": "Client login page that validates credentials against backend actor, stores authentication state via useClientAuth, and redirects to client dashboard on successful login.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space (including sidebar, neon-green, carbon-black), border radius variables, custom shadows (neon-glow), and accordion animations. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file for a VPS/hosting management system that tracks implemented and pending features including OS-specific connection instructions (SSH/RDP), client plan management with expiration dates, and machine registry with OS types (Windows/Ubuntu)."
}