{
  "backend/main.mo": "Motoko actor implementing a VPS client management system with CRUD operations for client records (including VM status, OS, plan expiry), global announcements, network monitoring, notifications, chat messages, and chat system status toggle.",
  "feature_evidence.json": "Feature evidence report documenting the refresh button implementation in ClientDashboard.tsx with high confidence, linked to test REQ-2 and multiple component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including authentication hooks, React Query hooks, UI components, pages, and styling with Carbon Black/Neon Green theme details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a dark theme color palette using oklch color space for both light and dark modes.",
  "frontend/index.html": "HTML entry point for the LuidCorporation Dashboard Ecosystem application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with admin/client routes, authentication providers, dark theme enforcement, layout with footer, and protected route wrappers.",
  "frontend/src/components/AdminChatPanel.tsx": "Admin chat management interface with client list, message history display, typing indicators, unread counts, and message sending functionality using React Query hooks.",
  "frontend/src/components/AdminProfileDisplay.tsx": "Admin profile display component showing avatar with initials, username from auth context, and administrator badge with shield icon.",
  "frontend/src/components/ChatSystemStatusIndicator.tsx": "Status indicator card displaying chat system online/offline state with colored circle icon and descriptive text using useChatSystemStatus hook.",
  "frontend/src/components/ChatSystemStatusToggle.tsx": "Admin control panel with radio group to toggle chat system between online and offline states, showing status descriptions and using mutation hooks with toast notifications.",
  "frontend/src/components/ChatWidget.tsx": "A floating chat widget component that allows clients to send messages to admin support, displays message history, typing indicators, unread counts, and shows online/offline status.",
  "frontend/src/components/ClientEditModal.tsx": "A modal dialog component for editing existing client records, including fields for credentials, VPS details, plan information, operating system selection, and plan expiry date picker.",
  "frontend/src/components/ClientList.tsx": "Displays a table of all registered clients with actions to edit, delete, send notifications, and update VM status; includes modals for editing and sending notifications.",
  "frontend/src/components/ClientProfileMenu.tsx": "A dropdown menu component showing authenticated client profile information including name, ID, plan details, expiry date, and logout functionality.",
  "frontend/src/components/ClientProtectedRoute.tsx": "A route guard component that redirects unauthenticated clients to the home page and only renders children for authenticated users.",
  "frontend/src/components/ClientRegistrationForm.tsx": "A form component for registering new clients with fields for ID, name, password, VPS credentials, plan details, operating system selection, and plan expiry date.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying copyright information for LuidCorporation 2026.",
  "frontend/src/components/GlobalAnnouncementBanner.tsx": "Displays a prominent animated banner at the top of the page showing global announcements fetched from the backend, hidden when no announcement exists.",
  "frontend/src/components/GlobalAnnouncementInput.tsx": "Admin component for creating, updating, and clearing global announcements displayed to all clients. Uses form with textarea, save/delete buttons, and toast notifications.",
  "frontend/src/components/NetworkMonitoringToggle.tsx": "Admin component with radio buttons to toggle network monitoring status between 'normal' (2.5-4.8 Gbps) and 'offline' (0 Gbps) modes.",
  "frontend/src/components/NetworkSpeedChart.tsx": "Displays a real-time line chart of network speed in Gbps using Recharts, showing current speed and historical data from simulation hook.",
  "frontend/src/components/NotificationBell.tsx": "Bell icon popover showing unread count badge, global announcements, and client-specific notifications with clear functionality. Displays scrollable list of messages.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated admin users to login page, only rendering children when authenticated.",
  "frontend/src/components/RdpInstructionsCard.tsx": "Card displaying step-by-step instructions for connecting to Windows VPS via Remote Desktop Protocol, including IP copy button and credential details.",
  "frontend/src/components/SendNotificationModal.tsx": "Modal dialog for admins to send individual notifications to specific clients with textarea input and form submission handling.",
  "frontend/src/components/SshInstructionsCard.tsx": "Card showing SSH connection instructions for Ubuntu servers with formatted command, copy-to-clipboard button, and terminal usage tips.",
  "frontend/src/components/VMStatusIndicator.tsx": "React component that displays VM status (online, offline, maintenance) with color-coded indicators and descriptions in a card layout.",
  "frontend/src/components/VpsCredentialsCard.tsx": "React component that displays VPS credentials (IP, username, password, plan) in a card with password visibility toggle functionality.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, automatically recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAdminAuth.tsx": "Context provider and hook for admin authentication with hardcoded credentials, supporting both localStorage and sessionStorage for session persistence.",
  "frontend/src/hooks/useClientAuth.tsx": "Context provider and hook for client authentication that manages client data and session persistence with optional 'remember me' functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing identity state, login/logout flows, and AuthClient configuration.",
  "frontend/src/hooks/useNetworkSpeedSimulation.ts": "Custom hook that simulates network speed data (2.5-4.8 Gbps) with realistic oscillation patterns, updating every 2 seconds and respecting monitoring status.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on client records, VM status, notifications, chat messages, and system settings via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom carbon black and neon green theme variables for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with form for ID/password authentication, remember-me checkbox, and navigation to admin panel on successful login using useAdminAuth hook.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard with tabs for managing clients and chat, includes client registration, announcements, network monitoring, and logout functionality.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard displaying VPS credentials, network monitoring, VM status, and SSH/RDP instructions with a refresh button to reload data from the backend.",
  "frontend/src/pages/ClientLogin.tsx": "Client login page that authenticates users via backend actor, validates credentials, and uses useClientAuth hook with remember-me option to persist sessions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme (carbon-black, neon-green), animations, and design tokens for the application's dark theme.",
  "project_state.json": "Project metadata tracking feature requests to fix 'keep me logged in' functionality and add a client data refresh button, with architectural notes and issue tracking."
}