{
  "backend/main.mo": "Main backend actor managing client records (with idLuid, nome, senhaCliente, ipVps, userVps, senhaVps, plano), global announcements, and network monitoring status with CRUD operations and migration support.",
  "backend/migration.mo": "Migration module that transforms old client records (without nome/senhaCliente fields) to new schema by adding default values for nome and senhaCliente, and initializes networkMonitoringStatus to 'normal'.",
  "feature_evidence.json": "Feature evidence report documenting seven implemented features including client registration/edit forms with nome/senhaCliente fields, client list updates, password-based authentication, and network monitoring toggle.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication hooks, forms, dashboards, and UI components with Carbon Black/Neon Green theming and client/admin portal functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining dark theme variables for Carbon Black backgrounds and Neon Green accents across all UI components.",
  "frontend/index.html": "HTML entry point for the LuidCorporation Dashboard Ecosystem React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with admin/client routes, authentication providers, dark theme enforcement, and protected route wrappers for both portals.",
  "frontend/src/components/ClientEditModal.tsx": "Modal dialog component for editing existing client records with pre-filled form fields for all seven client properties (idLuid, nome, senhaCliente, ipVps, userVps, senhaVps, plano) and backend update integration.",
  "frontend/src/components/ClientList.tsx": "Displays a table of all registered clients with their details (ID, name, VPS credentials, plan) and provides edit/delete actions. Uses React Query hooks for data fetching and mutations, with toast notifications for user feedback.",
  "frontend/src/components/ClientProtectedRoute.tsx": "A route guard component that redirects unauthenticated clients to the home page. Uses the useClientAuth hook to check authentication status.",
  "frontend/src/components/ClientRegistrationForm.tsx": "Form component for registering new clients with fields for ID, name, password, VPS credentials, and plan. Validates required fields and uses React Query mutation to create client records.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying branding text for LuidCloud Computing and a powered-by link to caffeine.ai with UTM tracking.",
  "frontend/src/components/GlobalAnnouncementBanner.tsx": "Displays a global announcement banner at the top of the page with an alert icon and animated pulse effect. Only renders when an announcement exists.",
  "frontend/src/components/GlobalAnnouncementInput.tsx": "Admin interface for setting or clearing a global announcement message that displays to all clients. Includes textarea input with save and clear buttons.",
  "frontend/src/components/NetworkMonitoringToggle.tsx": "Admin control panel for toggling network monitoring status between 'normal' (2.5-4.8 Gbps) and 'offline' (0 Gbps) modes using radio buttons.",
  "frontend/src/components/NetworkSpeedChart.tsx": "Displays a real-time line chart of network speed using Recharts, showing current speed in Gbps and historical data with a 2-5 Gbps range.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated admins to the admin login page. Uses the useAdminAuth hook to check authentication status.",
  "frontend/src/components/VpsCredentialsCard.tsx": "Card component displaying VPS access credentials including IP address, username, password (with show/hide toggle), and contracted plan information.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Context provider and hook for admin authentication with hardcoded credentials, supporting login/logout and persistent sessions via localStorage or sessionStorage.",
  "frontend/src/hooks/useClientAuth.tsx": "Context provider and hook for client authentication that stores ClientRecord data in sessionStorage and manages login/logout state.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication using DFINITY's AuthClient, managing identity state, login flow, and delegation validation with configurable options.",
  "frontend/src/hooks/useNetworkSpeedSimulation.ts": "Hook that simulates realistic network speed data (2.5-4.8 Gbps) using sine waves and randomness, updating every 2 seconds and respecting monitoring status (offline shows 0 speed).",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on client records, global announcements, and network monitoring status, all using the backend actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Carbon Black and Neon Green theme variables, defining color schemes for light/dark modes and component styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page component with form inputs for ID/password, remember-me checkbox, and authentication handling via useAdminAuth hook with navigation to master panel on success.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with header, logout button, and grid layout containing ClientRegistrationForm, GlobalAnnouncementInput, NetworkMonitoringToggle, and ClientList components.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard page displaying VPS credentials card and network speed chart, with global announcement banner and logout functionality using client authentication.",
  "frontend/src/pages/ClientLogin.tsx": "Client login page with form accepting ID Luid and password, validates credentials against backend actor, and redirects to dashboard on success.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (carbon-black, neon-green), extended theme tokens using OKLCH color space, and custom animations for accordions.",
  "project_state.json": "Project state document tracking architectural decisions, features, and requirements for a two-tier dashboard system with admin panel and client portals, including authentication, network simulation, and announcement propagation."
}