{
  "backend/main.mo": "Main Motoko actor implementing client record CRUD operations, global announcements, network monitoring status, and per-client notifications with Map-based storage and migration support.",
  "backend/migration.mo": "Migration module defining data structures for upgrading from OldActor (without notifications) to NewActor (with notifications Map) while preserving existing client records and settings.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: Stay Connected checkbox, profile menu, notification bell, admin notification sending UI, and client-specific notification display.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend TypeScript/React files covering authentication hooks, components, pages, and styling with Carbon Black/Neon Green theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for dark theme using Carbon Black backgrounds and Neon Green accents.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the LuidCorporation Dashboard Ecosystem React application.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with admin/client login and dashboard routes, theme provider, authentication providers, and protected route wrappers.",
  "frontend/src/components/ClientEditModal.tsx": "Dialog modal component for editing existing client records with form fields for all client properties (nome, senhaCliente, ipVps, userVps, senhaVps, plano) and update mutation integration.",
  "frontend/src/components/ClientList.tsx": "Displays a table of all registered clients with their details (ID, name, VPS info, plan) and provides actions to edit, delete, or send notifications to individual clients.",
  "frontend/src/components/ClientProfileMenu.tsx": "Renders a dropdown menu with client avatar showing their initials, name, ID, and a logout option for authenticated clients.",
  "frontend/src/components/ClientProtectedRoute.tsx": "A route guard component that redirects unauthenticated clients to the home page and only renders children for authenticated users.",
  "frontend/src/components/ClientRegistrationForm.tsx": "Form component for registering new clients with fields for ID, name, password, VPS credentials, and plan information.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright text 'LuidCorporation© 2026' with neon-green themed styling.",
  "frontend/src/components/GlobalAnnouncementBanner.tsx": "Displays a global announcement banner at the top of the page with an alert icon and animated pulse effect when an announcement is active.",
  "frontend/src/components/GlobalAnnouncementInput.tsx": "Admin interface for creating, updating, or clearing global announcements that will be displayed to all clients.",
  "frontend/src/components/NetworkMonitoringToggle.tsx": "Admin control panel with radio buttons to toggle network monitoring status between 'normal' (2.5-4.8 Gbps) and 'offline' (0 Gbps) modes.",
  "frontend/src/components/NetworkSpeedChart.tsx": "Displays a real-time line chart showing network speed monitoring data with current speed display, using simulated data between 2-5 Gbps.",
  "frontend/src/components/NotificationBell.tsx": "Notification bell component that displays a popover with global announcements and individual notifications, showing unread count badge and allowing users to clear notifications.",
  "frontend/src/components/ProtectedRoute.tsx": "Route protection component that redirects unauthenticated admin users to the login page using useAdminAuth hook.",
  "frontend/src/components/SendNotificationModal.tsx": "Modal dialog component for sending individual notifications to specific clients with a textarea input and form submission handling.",
  "frontend/src/components/VpsCredentialsCard.tsx": "Card component displaying VPS credentials including IP address, username, password (with show/hide toggle), and contracted plan information.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages backend actor instances based on Internet Identity authentication state, invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Context provider and hook for admin authentication with hardcoded credentials, supporting both localStorage (remember me) and sessionStorage persistence.",
  "frontend/src/hooks/useClientAuth.tsx": "Context provider and hook for client authentication that manages client data and session persistence with optional remember me functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication using DFINITY AuthClient, managing identity state, login/logout flows, and delegation validity.",
  "frontend/src/hooks/useNetworkSpeedSimulation.ts": "Hook that simulates network speed data points using sine wave oscillation (2.5-4.8 Gbps range) with monitoring status checks, updating every 2 seconds and maintaining last 20 data points.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on client records, global announcements, and notifications, using the actor from useActor hook and managing query cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Carbon Black and Neon Green theme variables using OKLCH color space, defining design tokens for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with form for ID and password authentication, remember-me functionality, and navigation to admin panel on success.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page displaying client registration form, global announcement input, network monitoring toggle, and client list with logout functionality.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard page showing VPS credentials, network speed chart, global announcements, and profile menu with notifications.",
  "frontend/src/pages/ClientLogin.tsx": "Client login page that authenticates users via ID Luid and password against backend actor, with remember-me option and navigation to dashboard.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom colors (carbon-black, neon-green), OKLCH color system, animations, and container settings.",
  "project_state.json": "Project state tracking a client authentication and notification system with features for persistent login, profile management, and both global and individual client notifications. Contains 5 completed features and 1 pending backend feature (AR-4) for storing individual client notifications."
}