{
  "backend/main.mo": "Main actor defining client management system with CRUD operations for client records, VM status, notifications, chat messages, access logs, global announcements, and network monitoring, using Map and List data structures with migration support.",
  "backend/migration.mo": "Migration module defining type definitions for client records, notifications, chat messages, access logs, and actor state, with a run function that migrates old actor state to new state by adding an empty accessLogs list.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: Activity Logs section, Database Export button, error alerts for invalid login, loading effects, and copy-to-clipboard buttons, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including authentication hooks, query hooks, protected routes, UI components, and pages for both admin and client portals with their key functionalities.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like background, foreground, cards, borders, charts, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, title \"LuidCorporation Dashboard Ecosystem\", and script tag loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for admin login/panel and client login/dashboard, wrapped in ThemeProvider, AdminAuthProvider, and ClientAuthProvider with protected route components and dark theme enforcement.",
  "frontend/src/components/ActivityLogsTable.tsx": "Card component displaying access logs in a table with client ID, formatted timestamp (Brazilian locale), and IP address columns, sorted by most recent first, with loading state and empty state handling.",
  "frontend/src/components/AdminChatPanel.tsx": "Admin chat panel component that displays a list of clients and allows admins to view and respond to client messages in real-time with typing indicators and message history.",
  "frontend/src/components/AdminProfileDisplay.tsx": "Displays the admin user profile with avatar, username, and admin badge in a styled card component.",
  "frontend/src/components/ChatSystemStatusIndicator.tsx": "Shows the current chat system status (online/offline) with a colored indicator and loading state.",
  "frontend/src/components/ChatSystemStatusToggle.tsx": "Admin control to toggle the chat system between online and offline states using a radio group interface.",
  "frontend/src/components/ChatWidget.tsx": "Floating chat widget for clients with message history, typing indicators, unread count badge, and offline status detection.",
  "frontend/src/components/ClientEditModal.tsx": "Modal dialog for editing client records including name, credentials, VPS details, plan, operating system, and expiry date with form validation.",
  "frontend/src/components/ClientList.tsx": "Table view of all registered clients with actions to edit, delete, send notifications, and update VM status (online/offline/maintenance).",
  "frontend/src/components/ClientProfileMenu.tsx": "Dropdown menu component displaying client profile information (name, ID, plan, expiry date) with logout functionality and avatar initials.",
  "frontend/src/components/ClientProtectedRoute.tsx": "Route guard component that redirects unauthenticated clients to the home page using useClientAuth hook.",
  "frontend/src/components/ClientRegistrationForm.tsx": "Form component for admin to register new clients with fields for ID, name, password, VPS credentials, plan details, operating system, and expiry date.",
  "frontend/src/components/DatabaseExportButton.tsx": "Button component that exports all client records to a timestamped JSON file for database backup purposes.",
  "frontend/src/components/Footer.tsx": "Footer component with links to Terms of Use and Privacy Policy modals, copyright notice, and caffeine.ai attribution.",
  "frontend/src/components/GlobalAnnouncementBanner.tsx": "Banner component that displays a global announcement message at the top of the page with an alert icon and pulsing animation.",
  "frontend/src/components/GlobalAnnouncementInput.tsx": "Admin form component to create, update, or clear global announcement messages displayed to all clients.",
  "frontend/src/components/LegalContentModal.tsx": "Modal dialog component displaying either Terms of Use or Privacy Policy content with scrollable text sections.",
  "frontend/src/components/NetworkMonitoringToggle.tsx": "Admin control component with radio buttons to toggle network monitoring status between 'normal' (2.5-4.8 Gbps) and 'offline' (0 Gbps).",
  "frontend/src/components/NetworkSpeedChart.tsx": "Displays a real-time line chart showing network speed monitoring with current speed in Gbps, using Recharts and a custom hook for simulated data.",
  "frontend/src/components/NotificationBell.tsx": "Notification bell popover component that displays global announcements and user-specific notifications with unread count badge and clear functionality.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated admin users to the login page using admin auth hook.",
  "frontend/src/components/RdpInstructionsCard.tsx": "Card component displaying step-by-step instructions for connecting to a Windows VPS via Remote Desktop Protocol with IP copy functionality.",
  "frontend/src/components/SendNotificationModal.tsx": "Modal dialog for admins to send individual notifications to specific clients with message textarea and submission handling.",
  "frontend/src/components/SshInstructionsCard.tsx": "Card component showing SSH connection instructions for Ubuntu servers with a copyable SSH command string.",
  "frontend/src/components/VMStatusIndicator.tsx": "Displays VM operational status (online/offline/maintenance) with color-coded indicators and descriptive messages.",
  "frontend/src/components/VpsCredentialsCard.tsx": "Card displaying VPS credentials (IP, username, password, plan) with copy-to-clipboard buttons and password visibility toggle.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Provides admin authentication context with hardcoded credentials, managing login/logout state and persisting authentication in localStorage or sessionStorage.",
  "frontend/src/hooks/useClientAuth.tsx": "Provides client authentication context, storing ClientRecord data in localStorage or sessionStorage with optional remember-me functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication provider using DFINITY AuthClient, managing identity state, login flow, and delegation validation with configurable options.",
  "frontend/src/hooks/useNetworkSpeedSimulation.ts": "Simulates network speed data (2.5-4.8 Gbps) using sine waves and randomness, updating every 2 seconds and respecting monitoring status (offline returns 0).",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on client records, notifications, chat messages, system status, and access logs, all using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a carbon black and neon green color theme, including custom utilities for card glow effects and neon animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page component with form validation, remember-me checkbox, and integration with useAdminAuth hook for authentication.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with tabs for managing clients, chat, and activity logs. Includes header with logout, database export, and profile display, plus components for client registration, announcements, network monitoring, and chat system controls.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard page displaying VPS credentials, network speed charts, VM status, SSH/RDP instructions, and global announcements. Features refresh button, notification bell, profile menu, and chat widget with authentication-based data fetching.",
  "frontend/src/pages/ClientLogin.tsx": "Client login page with ID and password authentication, remember-me checkbox, and access logging. Validates credentials against backend actor, displays styled error toasts for invalid IDs, and includes loading states with neon-themed UI.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, including neon-green and carbon-black theme colors, custom animations for accordions, and neon-glow shadow effects for premium visual identity.",
  "project_state.json": "Project state document tracking implemented features including activity logs, database export, error handling, loading effects, copy-to-clipboard functionality, footer links, and premium visual styling with green glow effects and status indicators."
}