{
  "backend/main.mo": "Main Motoko actor implementing client management system with CRUD operations for client records, VM status tracking, notifications, chat messages, global announcements, network monitoring, and chat system status (online/offline) with migration support.",
  "backend/migration.mo": "Migration module defining data types and a run function to migrate from OldActor to NewActor schema, adding chatSystemStatus field initialized to #offline while preserving existing client records, notifications, and chat messages.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: typing indicator in chat interface, online/offline status indicator for chat system in admin panel, and admin controls to toggle chat status between online and offline.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including authentication hooks, React Query hooks for backend operations, UI components for admin/client portals, chat management, network monitoring, and styling configuration with Carbon Black and Neon Green theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color system, with dark theme featuring Carbon Black backgrounds and Neon Green accents.",
  "frontend/index.html": "HTML entry point for the LuidCorporation Dashboard Ecosystem application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for admin/client login and dashboards, protected route wrappers, theme provider forcing dark mode, and authentication context providers for both admin and client sessions.",
  "frontend/src/components/AdminChatPanel.tsx": "Admin chat management component displaying client list with unread counts, message history with auto-scroll, typing indicator simulation, and message sending functionality using React Query hooks for real-time chat data.",
  "frontend/src/components/AdminProfileDisplay.tsx": "Admin profile display component showing avatar with initials, username from auth context, and administrator badge with shield icon in a styled card.",
  "frontend/src/components/ChatSystemStatusIndicator.tsx": "Status indicator component displaying chat system online/offline state with colored circle icon (green for online, red for offline) and descriptive text, fetching status from backend via React Query.",
  "frontend/src/components/ChatSystemStatusToggle.tsx": "Admin component to toggle chat system online/offline status using a radio group, with loading states and success/error toasts.",
  "frontend/src/components/ChatWidget.tsx": "Client-facing floating chat widget with message history, typing indicators, unread count badge, and offline status detection.",
  "frontend/src/components/ClientEditModal.tsx": "Modal dialog for editing client records with form fields for name, passwords, VPS credentials, plan, and VM status.",
  "frontend/src/components/ClientList.tsx": "Admin table view of all clients with inline VM status dropdown, edit/delete/notification actions, and status color indicators.",
  "frontend/src/components/ClientProfileMenu.tsx": "Dropdown menu in header showing client avatar with initials, name, ID, and logout option.",
  "frontend/src/components/ClientProtectedRoute.tsx": "Route guard component that redirects unauthenticated clients to home page.",
  "frontend/src/components/ClientRegistrationForm.tsx": "Admin form to create new client records with fields for ID, name, client password, VPS credentials, and plan.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright text 'LuidCorporation© 2026'.",
  "frontend/src/components/GlobalAnnouncementBanner.tsx": "Animated banner at top of page displaying global announcement text with alert icon, hidden when empty.",
  "frontend/src/components/GlobalAnnouncementInput.tsx": "Admin component for creating, updating, and clearing a global announcement message that displays to all clients. Uses form with textarea, save/clear buttons, and toast notifications.",
  "frontend/src/components/NetworkMonitoringToggle.tsx": "Admin component with radio buttons to toggle network monitoring status between 'normal' (2.5-4.8 Gbps) and 'offline' (0 Gbps). Uses query hooks and toast notifications.",
  "frontend/src/components/NetworkSpeedChart.tsx": "Displays a real-time line chart of network speed in Gbps using Recharts, showing current speed and historical data from a simulation hook.",
  "frontend/src/components/NotificationBell.tsx": "Client notification bell icon with popover showing unread count, global announcements, and individual notifications. Includes clear-all functionality.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated admin users to the login page using admin auth hook and navigation.",
  "frontend/src/components/SendNotificationModal.tsx": "Modal dialog for admins to send individual notification messages to specific clients by ID. Includes textarea form and submission handling.",
  "frontend/src/components/VMStatusIndicator.tsx": "Displays VM status (online/offline/maintenance) with color-coded indicator, label, and description in a card component.",
  "frontend/src/components/VpsCredentialsCard.tsx": "Card displaying VPS credentials including IP address, username, password (with show/hide toggle), and plan name in a formatted layout.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Provides admin authentication context with hardcoded credentials (SidneiCosta00/Nikebolado@4), login/logout functions, and persistent auth state using localStorage or sessionStorage.",
  "frontend/src/hooks/useClientAuth.tsx": "Provides client authentication context that stores ClientRecord data in localStorage or sessionStorage, with login/logout functions and remember-me functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication for ICP, providing a React context and hooks for login, logout, and identity management with configurable AuthClient options.",
  "frontend/src/hooks/useNetworkSpeedSimulation.ts": "Simulates network speed data (2.5-4.8 Gbps) using sine waves and random variation, updating every 2 seconds and respecting monitoring status (offline shows 0 speed).",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on client records, VM status updates, notifications, chat messages, and global announcements using the ICP actor backend.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a carbon black and neon green color theme, including CSS custom properties for light/dark modes and design tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page component with form inputs for ID/password, remember-me checkbox, and integration with useAdminAuth hook for authentication.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with tabs for client management and chat, includes header with logout, and displays components for client registration, announcements, network monitoring, chat panel, and chat system status controls.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard page displaying VPS credentials, network speed chart, VM status, global announcements, notifications, and chat widget; fetches client record data and shows loading state.",
  "frontend/src/pages/ClientLogin.tsx": "Client login page with form for ID Luid and password authentication, includes remember me checkbox, validates credentials against backend actor, and redirects to dashboard on success.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme (carbon-black, neon-green), extended theme with OKLCH colors, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document showing three completed features for chat typing indicators and online/offline status management in admin panel, with corresponding pending feature requests."
}