{
  "backend/main.mo": "Motoko actor implementing CRUD operations for client records (with idLuid, nome, senhaCliente, ipVps, userVps, senhaVps, plano fields), global announcement management, and network monitoring status (normal/offline) using in-memory Map storage.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: removal of caffeine.ai branding from footer and updating footer copyright to 'LuidCorporation© 2026', both with high confidence.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including authentication hooks, React Query hooks, UI components for admin/client portals, login pages, dashboards, and styling configurations with Carbon Black and Neon Green theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space, with dark mode as the primary theme.",
  "frontend/index.html": "HTML entry point with title 'LuidCorporation Dashboard Ecosystem' and root div for React application mounting.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with four routes (admin login, admin panel, client login, client dashboard), theme provider forcing dark mode, authentication providers, and protected route wrappers.",
  "frontend/src/components/ClientEditModal.tsx": "Dialog modal component for editing existing client records with form fields for all client properties (except idLuid which is disabled), using React Query mutation for updates and toast notifications.",
  "frontend/src/components/ClientList.tsx": "Table component displaying all registered clients with columns for idLuid, nome, IP VPS, user VPS, and plano, featuring edit and delete action buttons with loading states and modal integration.",
  "frontend/src/components/ClientProtectedRoute.tsx": "Route protection wrapper component that checks client authentication status and redirects unauthenticated users to the root login page.",
  "frontend/src/components/ClientRegistrationForm.tsx": "Form component for registering new clients with fields for ID, name, password, VPS credentials, and plan. Validates all fields are required and uses mutation hook to create client records.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright text 'LuidCorporation© 2026' with neon-green border styling.",
  "frontend/src/components/GlobalAnnouncementBanner.tsx": "Banner component that displays a global announcement message with an alert icon and pulsing animation. Only renders when announcement text exists.",
  "frontend/src/components/GlobalAnnouncementInput.tsx": "Admin form component for setting or clearing global announcements with a textarea input. Includes save and delete buttons with loading states.",
  "frontend/src/components/NetworkMonitoringToggle.tsx": "Radio group component for toggling network monitoring status between 'normal' (2.5-4.8 Gbps) and 'offline' (0 Gbps) modes.",
  "frontend/src/components/NetworkSpeedChart.tsx": "Card component displaying a real-time line chart of network speed using Recharts. Shows current speed in Gbps with region and latency information.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to admin login page. Uses admin auth hook to check authentication status.",
  "frontend/src/components/VpsCredentialsCard.tsx": "Card component displaying VPS credentials including IP, username, password (with show/hide toggle), and plan information in a formatted layout.",
  "frontend/src/hooks/useActor.ts": "Hook for managing Internet Computer actor instances with authentication. Creates anonymous or authenticated actors based on identity and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Context provider and hook for admin authentication with hardcoded credentials. Manages login/logout state with localStorage or sessionStorage based on 'remember me' option.",
  "frontend/src/hooks/useClientAuth.tsx": "Context provider and hook for client authentication. Stores client record data in sessionStorage and manages login/logout state for client users.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useNetworkSpeedSimulation.ts": "Simulates network speed data (2.5-4.8 Gbps) using sine waves and randomness, updating every 2 seconds and respecting monitoring status (offline = 0 speed).",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on client records, global announcements, and network monitoring status, all interacting with the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Carbon Black and Neon Green theme variables, defining colors for UI components in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with ID/password form, remember-me checkbox, and authentication handling that redirects to the master panel on success.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard displaying client registration form, global announcement input, network monitoring toggle, and client list with logout functionality.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard showing VPS credentials, network speed chart, and global announcements with logout functionality and client ID display.",
  "frontend/src/pages/ClientLogin.tsx": "React component implementing a client login page with ID Luid and password authentication, using ICP actor to verify credentials and navigate to client dashboard on success.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including carbon-black, neon-green, card-dark), container settings, border radius variables, animations, and theme extensions using OKLCH color space.",
  "project_state.json": "Project state metadata tracking two completed features: removal of Caffeine AI branding from footer and updating copyright text to 'LuidCorporation© 2026'."
}