{
  "backend/main.mo": "Main actor implementing employee/client authentication, CRUD operations for employees and client records, global announcements, network monitoring status, and role-based access control (Master/Employee) with authorization mixins.",
  "backend/migration.mo": "Migration module that transforms old actor state to new state, removing deprecated masterEmployee field and updating the SidneiCosta00 employee password and role to Master.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend components, pages, hooks, and configuration files describing their functionality and purpose.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for admin/client login and dashboards, theme provider, authentication providers, and protected route wrappers.",
  "frontend/src/components/ClientEditModal.tsx": "Dialog modal component for editing existing client records with form fields for all client properties (except read-only idLuid) and backend mutation integration.",
  "frontend/src/components/ClientList.tsx": "Table component displaying all client records with conditional edit/delete action buttons based on isMasterRole prop, integrating ClientEditModal for updates.",
  "frontend/src/components/ClientProtectedRoute.tsx": "Route guard component that redirects unauthenticated clients to the login page using client authentication context.",
  "frontend/src/components/ClientRegistrationForm.tsx": "Form component for registering new clients with fields for ID, name, password, VPS credentials, and plan. Validates all required fields and uses mutation hook to create client records with toast notifications.",
  "frontend/src/components/EmployeeEditModal.tsx": "Modal dialog for editing employee details (name, password, role) with special handling to prevent editing the master employee's role. Includes password visibility toggle and uses update mutation hook.",
  "frontend/src/components/EmployeeList.tsx": "Displays a table of all employees with edit and delete actions. Includes confirmation dialog for deletions and integrates with EmployeeEditModal for updates.",
  "frontend/src/components/EmployeeRegistrationForm.tsx": "Form component for creating new employees with fields for employee ID, name, password, and role selection. Features password visibility toggle and uses create mutation hook with validation.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying branding for LuidCloud Computing and a powered-by attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/GlobalAnnouncementBanner.tsx": "Displays a global announcement banner at the top of the page with animated pulse effect. Only renders when an announcement exists.",
  "frontend/src/components/GlobalAnnouncementInput.tsx": "Admin interface for setting or clearing global announcements shown to all clients. Features textarea input with save and clear buttons using mutation hooks.",
  "frontend/src/components/NetworkMonitoringToggle.tsx": "React component that provides a radio group toggle to switch network monitoring status between 'normal' (active monitoring with 2.5-4.8 Gbps) and 'offline' (0 Gbps), using custom hooks for fetching and updating status.",
  "frontend/src/components/NetworkSpeedChart.tsx": "React component that displays a real-time line chart of network speed in Gbps using Recharts, showing current speed and historical data from the useNetworkSpeedSimulation hook.",
  "frontend/src/components/ProtectedRoute.tsx": "React component that wraps children and redirects unauthenticated users to the admin login page using the useAdminAuth hook.",
  "frontend/src/components/VpsCredentialsCard.tsx": "React component that displays VPS credentials (IP, username, password, plan) in a card layout with a toggle to show/hide the password field.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous actor for backend communication, initializing access control with a secret token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "React context and hook for admin authentication, managing login/logout state, employee ID and role (including Master role detection), with persistence to localStorage or sessionStorage.",
  "frontend/src/hooks/useClientAuth.tsx": "React context and hook for client authentication, managing login/logout state and client data with persistence to sessionStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, providing identity management, login/logout functionality, and status tracking with configurable AuthClient options.",
  "frontend/src/hooks/useNetworkSpeedSimulation.ts": "Custom React hook that simulates network speed data points (2.5-4.8 Gbps using sine wave with randomness) or returns 0 Gbps when monitoring status is offline, updating every 2 seconds and maintaining the last 20 data points.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on client records, employees, global announcements, and network monitoring, using the actor from useActor and managing cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Carbon Black and Neon Green theme variables for light and dark modes, including color definitions for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page with form for employee ID and password authentication, remember-me checkbox, and navigation to the master panel on success.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard displaying client management, global announcements, network monitoring toggle, and employee management (master-only), with role-based UI rendering.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard page showing VPS credentials card, network speed chart, and global announcement banner with logout functionality.",
  "frontend/src/pages/ClientLogin.tsx": "Client login page that validates ID Luid and password against backend records, then navigates to the client dashboard on successful authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space (including neon-green, carbon-black, sidebar colors), border radius variables, animations (accordion), and integrating typography, container queries, and animate plugins.",
  "project_state.json": "Project state document describing a two-tier dashboard system with admin panel at /luid-master-panel and client portals, featuring network simulation, global announcements, client management, dark theme with neon green accents, and authentication using ID_Luid + password."
}