{
  "backend/main.mo": "Motoko actor implementing a VPS client management system with CRUD operations for client records (including VM status, OS, plan expiry), notifications, chat messages, global announcements, network monitoring, and chat system status with in-memory Map storage.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: chat message timestamps, message status indicators, light/dark theme toggle, and enhanced dashboard design with high confidence levels and associated test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including authentication hooks, React Query hooks for backend operations, protected routes, UI components (forms, charts, cards, banners), admin/client pages, and global styles with OKLCH color system for theming.",
  "frontend/index.css": "Tailwind CSS configuration with comprehensive light and dark theme color variables using OKLCH color space, defining colors for backgrounds, foregrounds, borders, charts, and sidebar components with custom radius and opacity values.",
  "frontend/index.html": "HTML entry point for the LuidCorporation Dashboard Ecosystem application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with admin and client routes (login/dashboard), QueryClient, ThemeProvider, authentication providers, protected routes, footer, and toast notifications.",
  "frontend/src/components/AdminChatPanel.tsx": "Admin chat management component displaying client list with unread counts, message thread view with timestamps and read/sent indicators (Check/CheckCheck icons), message input with typing detection, and auto-scrolling using formatMessageTime utility.",
  "frontend/src/components/AdminProfileDisplay.tsx": "Admin profile display component showing avatar with initials, username from useAdminAuth hook, and administrator badge with Shield icon in a neon-green themed card.",
  "frontend/src/components/ChatSystemStatusIndicator.tsx": "Card component displaying real-time chat system status (online/offline) with colored Circle indicator and loading state using useChatSystemStatus hook.",
  "frontend/src/components/ChatSystemStatusToggle.tsx": "Admin component to toggle chat system online/offline status using radio buttons, with loading states and toast notifications.",
  "frontend/src/components/ChatWidget.tsx": "Floating chat widget for clients with message display, send functionality, unread count badge, typing indicators, and offline status handling.",
  "frontend/src/components/ClientEditModal.tsx": "Modal dialog for editing client records with form fields for credentials, VPS details, plan info, OS selection, and date picker for plan expiry.",
  "frontend/src/components/ClientList.tsx": "Admin table view of all clients with edit, delete, notification, and VM status update actions, plus modals for editing and sending notifications.",
  "frontend/src/components/ClientProfileMenu.tsx": "Dropdown menu showing authenticated client's profile info (name, ID, plan, expiry date) with logout functionality.",
  "frontend/src/components/ClientProtectedRoute.tsx": "Route guard component that redirects unauthenticated clients to home page.",
  "frontend/src/components/ClientRegistrationForm.tsx": "Admin form to create new client records with fields for credentials, VPS details, plan selection, OS choice, and expiry date picker.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright text for LuidCorporation 2026.",
  "frontend/src/components/GlobalAnnouncementBanner.tsx": "Animated banner that displays global announcements at the top of the page when announcement text exists.",
  "frontend/src/components/GlobalAnnouncementInput.tsx": "Admin component for creating, updating, and clearing global announcements that display to all clients. Uses form with textarea, save button, and delete button with loading states.",
  "frontend/src/components/NetworkMonitoringToggle.tsx": "Admin component with radio buttons to toggle network monitoring status between 'normal' (2.5-4.8 Gbps) and 'offline' (0 Gbps). Displays current status and updates via mutation.",
  "frontend/src/components/NetworkSpeedChart.tsx": "Client-facing card displaying real-time network speed chart using Recharts LineChart. Shows current speed in Gbps and historical data with simulated network monitoring.",
  "frontend/src/components/NotificationBell.tsx": "Bell icon popover showing unread count badge, global announcements, and client-specific notifications. Includes clear all functionality and scrollable notification list.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that checks admin authentication status and redirects to login page if not authenticated. Renders children only when authenticated.",
  "frontend/src/components/RdpInstructionsCard.tsx": "Instructional card explaining how to connect to Windows VPS via Remote Desktop Protocol (RDP). Displays IP, username, step-by-step instructions, and copy-to-clipboard button.",
  "frontend/src/components/SendNotificationModal.tsx": "Modal dialog for admins to send individual notifications to specific clients. Contains textarea for message input and handles submission with loading states.",
  "frontend/src/components/SshInstructionsCard.tsx": "Instructional card explaining how to connect to Ubuntu VPS via SSH. Displays formatted SSH command with copy button and step-by-step connection instructions.",
  "frontend/src/components/ThemeToggle.tsx": "Button component that toggles between dark and light themes, displaying sun/moon icons with rotation animations. Uses custom theme hook for state management.",
  "frontend/src/components/VMStatusIndicator.tsx": "React component that displays VM status (online, offline, maintenance) with color-coded indicators and descriptions in a card layout.",
  "frontend/src/components/VpsCredentialsCard.tsx": "React component that displays VPS credentials (IP, username, password, plan) in a card with password visibility toggle functionality.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, creating authenticated or anonymous actors based on Internet Identity and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAdminAuth.tsx": "Context provider and hook for admin authentication with hardcoded credentials, supporting login/logout and persistent sessions via localStorage or sessionStorage.",
  "frontend/src/hooks/useClientAuth.tsx": "Context provider and hook for client authentication that manages ClientRecord data with optional 'remember me' functionality using localStorage or sessionStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using DFINITY's AuthClient, managing identity state, login/logout flows, and authentication status.",
  "frontend/src/hooks/useNetworkSpeedSimulation.ts": "Custom hook that simulates network speed data (2.5-4.8 Gbps) with realistic oscillation using sine waves and random variation, updating every 2 seconds and respecting monitoring status.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on client records, VM status, notifications, chat messages, announcements, and network monitoring, all using the backend actor.",
  "frontend/src/hooks/useTheme.tsx": "Context provider and hook for theme management (light/dark mode) with localStorage persistence and DOM class manipulation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark themes using oklch color space, featuring neon green and carbon black color scheme. Includes base styles for typography and utility classes for neon effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page component with form for ID and password authentication, remember-me functionality, and navigation to admin panel upon successful login using useAdminAuth hook.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard with tabbed interface for managing clients and chat system, including client registration, global announcements, network monitoring, and admin chat panel components.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard displaying VPS credentials, network speed monitoring, VM status, SSH/RDP instructions based on OS, and includes chat widget and notification features.",
  "frontend/src/pages/ClientLogin.tsx": "Client login page that authenticates users via ID Luid and password against backend actor, validates credentials, and redirects to client dashboard with remember-me option.",
  "frontend/src/utils/timeFormatters.ts": "Utility functions for formatting timestamps into human-readable time strings, including relative time (e.g., '5 min ago') and absolute time (HH:MM) formats.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending default theme with custom colors (neon green, carbon black), typography, shadows, animations, and design tokens for consistent styling across the application.",
  "project_state.json": "Project state file for LuidCorporation Dashboard tracking four existing features (timestamps, message status indicators, theme toggle, and design enhancements) and four pending feature requests. Uses schema version 1.0.0 with instant clarification mode."
}