{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add VM status management, live chat support, and multi-admin management",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Display VM status indicator for each client in the admin panel client list with visual differentiation for online/offline/maintenance states",
      "acceptanceCriteria": [
        "Client list table shows VM status badge for each client",
        "Online status displays with green indicator",
        "Offline status displays with red indicator",
        "Maintenance status displays with yellow/orange indicator"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ClientList.tsx",
          "operation": "modify",
          "description": "Add VM status badge column to the client table displaying the vmStatus field from ClientRecord. Implement three visual states: green badge for 'online', red badge for 'offline', and yellow/orange badge for 'maintenance'. Use the VMStatus enum from backend.d.ts to ensure type safety."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add ability to change VM status for individual clients through the client edit modal",
      "acceptanceCriteria": [
        "Client edit modal includes a dropdown or radio button group to select VM status",
        "Admin can change status between online, offline, and maintenance",
        "Status change persists and updates the client list display immediately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ClientEditModal.tsx",
          "operation": "modify",
          "description": "Add a VM status selection field (dropdown or radio group) to the edit form with three options: online, offline, maintenance. Include the vmStatus field in the form state and pass it to the updateClientRecord mutation. Use the VMStatus enum from backend.d.ts for type safety."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the updateClientRecord mutation includes the vmStatus parameter and invalidates the client list query after successful update to refresh the display immediately."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add a floating chat button on the client dashboard that opens a chat window for communication with administrators",
      "acceptanceCriteria": [
        "Floating chat icon button positioned fixed in bottom-right corner of client dashboard",
        "Clicking the button opens a chat window/dialog",
        "Chat window displays conversation history with the support team",
        "Client can type and send messages in the chat window",
        "Chat window can be closed and reopened without losing context"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ClientChatWidget.tsx",
          "operation": "create",
          "description": "Create a floating chat widget component with a fixed-position button in the bottom-right corner. Implement a dialog/modal that opens on click, displaying chat message history fetched via getChatMessages backend method. Include a message input field and send button that calls the sendMessage backend method with the client's ID as sender. Use Carbon Black and Neon Green theme for styling. The widget maintains conversation context across open/close cycles."
        },
        {
          "path": "frontend/src/pages/ClientDashboard.tsx",
          "operation": "modify",
          "description": "Import and render the ClientChatWidget component at the root level of the dashboard so it appears as a floating element on top of the existing content."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add query hooks for fetching chat messages (getChatMessages) and a mutation hook for sending messages (sendMessage). Include proper cache invalidation to refresh chat history after sending a message."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Create an admin chat interface in the admin panel to view and respond to client messages",
      "acceptanceCriteria": [
        "Admin panel includes a chat section showing all active client conversations",
        "Admin can select a client conversation to view message history",
        "Admin can send messages to clients through the chat interface",
        "New messages from clients are highlighted or indicated with unread status"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminChatInterface.tsx",
          "operation": "create",
          "description": "Create an admin chat interface component displaying a list of all clients (from getAllClientRecords) in a sidebar. When a client is selected, display their conversation history using getChatMessages with the client's idLuid. Include a message input and send button that calls sendMessage with an admin identifier as sender. Implement visual indicators for conversations with recent messages. Use Carbon Black and Neon Green theme consistent with the existing design."
        },
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "modify",
          "description": "Add the AdminChatInterface component to the admin panel layout, positioning it as a new section alongside existing components (ClientRegistrationForm, GlobalAnnouncementInput, NetworkMonitoringToggle, ClientList)."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Create an admin member management interface to add, edit, and remove administrator accounts",
      "acceptanceCriteria": [
        "Admin panel includes a section for managing administrator accounts",
        "Interface allows creating new admin accounts with ID and password",
        "Admin list displays all registered administrators",
        "Administrators can be edited or removed from the list",
        "Only authenticated admins can access the member management interface"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminMemberManagement.tsx",
          "operation": "create",
          "description": "Create an admin member management component with a form for adding new administrators (username and password fields) that calls the addAdminAccount backend method. Display a list of registered administrators. Note: The backend interface does not currently expose methods to list, edit, or remove administrators, so this component will focus on the add functionality and display a placeholder message about edit/remove features requiring backend support."
        },
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "modify",
          "description": "Add the AdminMemberManagement component to the admin panel layout as a new section. Since the page is already protected by ProtectedRoute wrapper in App.tsx, no additional authentication guards are needed."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a mutation hook for addAdminAccount that calls the backend method to register new administrator accounts."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Update admin login to authenticate against backend-stored administrator accounts instead of hardcoded credentials",
      "acceptanceCriteria": [
        "Admin login validates credentials against backend-stored admin accounts",
        "Login works for all registered administrators, not just hardcoded credentials",
        "Failed login attempts show appropriate error messages",
        "Successful login maintains session persistence as currently implemented"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminLogin.tsx",
          "operation": "modify",
          "description": "Replace the hardcoded credential check with a call to the adminLogin backend method. Pass the entered username and password to the backend for validation. On successful authentication (adminLogin returns true), proceed with the existing session storage logic. On failure (returns false), display an error message to the user."
        },
        {
          "path": "frontend/src/hooks/useAdminAuth.tsx",
          "operation": "modify",
          "description": "Update the login function in the admin auth context to use the adminLogin backend method instead of comparing against hardcoded credentials. Maintain the existing localStorage and sessionStorage persistence logic for remember-me functionality. The isAuthenticated state should still be derived from storage, but initial login validation must go through the backend."
        }
      ]
    }
  ]
}