{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix remember-me option and add data refresh button",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the 'keep me logged in' functionality to properly persist client authentication sessions between browser sessions",
      "acceptanceCriteria": [
        "When 'keep me logged in' is checked, client authentication persists after closing and reopening the browser",
        "When unchecked, client authentication is cleared when browser is closed",
        "The remember-me state is properly saved to localStorage when checked and sessionStorage when unchecked"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useClientAuth.tsx",
          "operation": "modify",
          "description": "Fix the storage mechanism to properly use localStorage when remember-me is true and sessionStorage when false. Update the login function to accept a rememberMe parameter and persist it correctly. Ensure the authentication state is restored from the correct storage on component mount based on where data exists."
        },
        {
          "path": "frontend/src/pages/ClientLogin.tsx",
          "operation": "modify",
          "description": "Add a 'keep me logged in' checkbox to the login form. Pass the checkbox state to the useClientAuth login function to control whether authentication persists in localStorage or sessionStorage. Ensure the checkbox state is properly wired to the form submission handler."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a refresh button in the client dashboard that allows clients to manually reload their data when the administrator has modified their information",
      "acceptanceCriteria": [
        "A refresh button is visible and accessible in the client dashboard interface",
        "Clicking the button triggers a refetch of all client data from the backend",
        "The button shows a loading state while data is being refreshed",
        "After refresh completes, updated data (credentials, plan, expiry, VM status, etc.) is displayed immediately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ClientDashboard.tsx",
          "operation": "modify",
          "description": "Add a refresh button near the top of the dashboard (e.g., next to the profile menu or in a header section). Wire the button to trigger refetch of the client record using the existing React Query hooks. Implement loading state visualization on the button while data is being fetched. Ensure the refetch updates all displayed client data including credentials, plan, expiry, and VM status."
        }
      ]
    }
  ]
}