{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add typing indicator and chat online/offline status management",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Display a typing indicator in the chat interface when the other party is actively typing a message",
      "acceptanceCriteria": [
        "Typing indicator appears in chat when the other user is typing",
        "Indicator disappears when typing stops or message is sent",
        "Works bidirectionally for both admin and client chat views"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminChatPanel.tsx",
          "operation": "modify",
          "description": "Add typing indicator display logic to show when a client is typing. Track typing state through message input changes and display a visual typing indicator (e.g., animated dots) in the message list when the other party is typing. Clear the indicator when typing stops or a message is sent."
        },
        {
          "path": "frontend/src/components/ChatWidget.tsx",
          "operation": "modify",
          "description": "Add typing indicator display logic to show when admin is typing. Track typing state through message input changes and display a visual typing indicator in the message list when admin is typing. Clear the indicator when typing stops or a message is sent. Mirror the implementation pattern used in AdminChatPanel for consistency."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query mutations and queries for tracking typing status. Create mutations to signal when a user starts/stops typing and queries to poll for the other party's typing status. Use optimistic updates to provide immediate feedback without waiting for backend confirmation."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add online/offline status indicator for the chat system visible in the admin panel",
      "acceptanceCriteria": [
        "Chat status (online/offline) is displayed in the admin panel",
        "Status indicator clearly shows whether chat is available or unavailable",
        "Status persists across sessions"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatSystemStatusIndicator.tsx",
          "operation": "create",
          "description": "Create a new component that displays the current chat system status (online/offline) using the getChatSystemStatus backend method. Show a clear visual indicator with color-coded badges (neon green for online, red for offline) and descriptive text. Follow the pattern established by VMStatusIndicator component for consistent styling with the Carbon Black/Neon Green theme."
        },
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "modify",
          "description": "Integrate the ChatSystemStatusIndicator component into the admin panel, displaying it prominently in the Chat tab or header area so admins can always see the current chat availability status."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook to fetch the current chat system status using the getChatSystemStatus backend method. Implement polling or cache invalidation to keep the status up-to-date across the admin panel."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Provide admin controls to manually change the chat status between online and offline",
      "acceptanceCriteria": [
        "Admin can toggle chat status between online and offline",
        "Status change is immediately reflected in the admin panel",
        "When chat is offline, clients see an appropriate message or disabled state",
        "Status change persists in backend storage"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatSystemStatusToggle.tsx",
          "operation": "create",
          "description": "Create a new component with toggle controls (radio buttons or switch) allowing admins to change the chat system status between online and offline. Use the setChatSystemStatus backend method to persist changes. Include immediate visual feedback and success/error toast notifications. Follow the design pattern of NetworkMonitoringToggle for consistency."
        },
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "modify",
          "description": "Integrate the ChatSystemStatusToggle component into the admin panel Chat tab, placing it near the ChatSystemStatusIndicator for logical grouping of status display and controls."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation for updating chat system status using the setChatSystemStatus backend method. Implement optimistic updates and automatic query invalidation to refresh the status display immediately after changes."
        },
        {
          "path": "frontend/src/components/ChatWidget.tsx",
          "operation": "modify",
          "description": "Add logic to detect when chat system status is offline and display an appropriate disabled state or message to clients (e.g., 'Chat is currently unavailable'). Disable the message input and send button when status is offline. Poll the chat system status to detect when it comes back online."
        }
      ]
    }
  ]
}