{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add VM status management, support chat, and admin profile display",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add VM status edit controls in the admin panel for each client in the client list",
      "acceptanceCriteria": [
        "Each client row in the admin panel ClientList shows the current VM status",
        "Admin can change VM status through a dropdown or button group for each client",
        "Status changes are saved to the backend immediately",
        "Visual indicators (colors/icons) differentiate between online (green), offline (red), and maintenance (yellow/orange) statuses"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ClientList.tsx",
          "operation": "modify",
          "description": "Add a VM status column to the client table that displays the current vmStatus for each client. Include a dropdown or button group allowing admins to change the status between 'online', 'offline', and 'maintenance'. Use color coding: green for online, red for offline, yellow/orange for maintenance. Wire the status change to call the backend's updateVMStatus function immediately upon selection. Display visual indicators (icons or badges) alongside the status text."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook useUpdateVMStatus that calls the backend's updateVMStatus(idLuid, vmStatus) function. Configure the mutation to invalidate the client records query cache after successful status update to refresh the client list automatically."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display VM status indicator on the client dashboard showing their current VM state",
      "acceptanceCriteria": [
        "Client dashboard displays the current VM status with appropriate visual styling",
        "Status indicator uses consistent color coding matching admin panel (green=online, red=offline, yellow/orange=maintenance)",
        "Status updates in real-time when changed by admin"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ClientDashboard.tsx",
          "operation": "modify",
          "description": "Add a VM status indicator component to the dashboard that fetches the authenticated client's record and displays their vmStatus field. Use consistent color coding: green for online, red for offline, yellow/orange for maintenance. Position the indicator prominently, potentially near the VpsCredentialsCard or as a separate status card. Leverage React Query's auto-refetch to ensure status updates appear when admin changes the value."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Implement a floating chat button and chat window widget on the client dashboard",
      "acceptanceCriteria": [
        "A floating chat icon appears fixed on the client dashboard (typically bottom-right corner)",
        "Clicking the chat icon opens a chat window showing conversation history with support/admin",
        "Chat window displays messages in chronological order with clear sender identification",
        "Client can type and send messages through the chat interface",
        "Chat window can be minimized/closed while retaining conversation state",
        "Unread message indicator shows on the chat icon when new admin messages arrive"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChatWidget.tsx",
          "operation": "create",
          "description": "Create a floating chat widget component that includes a fixed-position chat button (bottom-right corner) and an expandable chat window. The chat button should display an unread message count badge when new messages from admin are detected. The chat window displays messages in chronological order with sender identification (client vs admin), includes a text input for composing messages, and has minimize/close controls. Use getMessages and sendMessage backend functions to load and send chat messages. Track open/closed state locally. Apply Carbon Black and Neon Green theming consistent with the app."
        },
        {
          "path": "frontend/src/pages/ClientDashboard.tsx",
          "operation": "modify",
          "description": "Import and render the ChatWidget component so it appears on the client dashboard. Position it as a fixed overlay element that remains accessible while clients view their dashboard content."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add query hooks useChatMessages(clientId) to fetch messages using getMessages backend function, and mutation hook useSendMessage to send messages via sendMessage backend function. Configure the send mutation to invalidate the chat messages query after successful send. Include polling or refetch interval to check for new admin messages periodically."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add a chat management interface in the admin panel showing all active client conversations",
      "acceptanceCriteria": [
        "Admin panel displays a list of clients with active chat conversations",
        "Admin can select a client to view and respond to their chat messages",
        "Admin chat interface shows full conversation history with the selected client",
        "Admin can send messages that appear in the client's chat window",
        "Visual indicator shows which clients have unread messages waiting for admin response"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminChatPanel.tsx",
          "operation": "create",
          "description": "Create an admin chat management component that displays a list of all clients with conversation threads. Show unread message indicators for clients who have sent messages. When admin selects a client, display the full chat history for that client using getMessages backend function. Include a message input allowing admin to send responses via sendMessage backend function with sender='admin' and receiver=clientId. Use a two-column layout: client list on the left, conversation view on the right."
        },
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "modify",
          "description": "Import and render the AdminChatPanel component in the admin panel, positioning it below or alongside the existing client management sections. Ensure the chat panel is visible and accessible to administrators viewing the admin dashboard."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Display the logged-in administrator's name/profile in the admin panel header",
      "acceptanceCriteria": [
        "Admin panel header displays the logged-in administrator's name or username",
        "Profile display is visible on all admin panel pages",
        "Profile section includes admin identification consistent with the authentication system"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminProfileDisplay.tsx",
          "operation": "create",
          "description": "Create a component that displays the logged-in admin's name or username retrieved from the useAdminAuth context. Style it consistently with the Carbon Black and Neon Green theme. Include an avatar or icon alongside the admin name for visual identification."
        },
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "modify",
          "description": "Import and render the AdminProfileDisplay component in the header section of the admin panel. Position it prominently (e.g., top-right corner) so it's visible on all admin panel pages. Ensure it displays alongside existing header elements like the logout button."
        }
      ]
    }
  ]
}